SET NAMES utf8;

CREATE TABLE IF NOT EXISTS `calendar` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL,
  `day` tinyint(4) NOT NULL,
  `comment` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `date` (`date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

INSERT INTO `calendar` VALUES
(1,'2024-01-01',9,'Новогодние каникулы'),
(3,'2024-01-02',9,'Новогодние каникулы'),
(5,'2024-01-03',9,'Новогодние каникулы'),
(7,'2024-01-04',9,'Новогодние каникулы'),
(9,'2024-01-05',9,'Новогодние каникулы'),
(11,'2024-01-06',9,'Новогодние каникулы'),
(13,'2024-01-08',9,'Новогодние каникулы'),
(15,'2024-01-07',9,'Рождество Христово'),
(17,'2024-02-23',9,'День защитника Отечества'),
(19,'2024-03-08',9,'Международный женский день'),
(21,'2024-05-01',9,'Праздник Весны и Труда'),
(23,'2024-05-09',9,'День Победы'),
(25,'2024-06-12',9,'День России'),
(27,'2024-11-04',9,'День народного единства'),
(29,'2024-02-22',8,NULL),
(31,'2024-03-07',8,NULL),
(33,'2024-05-08',8,NULL),
(35,'2024-06-11',8,NULL),
(37,'2024-11-02',8,NULL),
(39,'2024-05-10',7,'Перенос с субботы 6 января'),
(41,'2024-12-31',1,'Перенос с воскресенья 7 января'),
(43,'2024-04-27',2,'Перенос с понедельника 29 апреля'),
(45,'2024-04-29',7,'Перенос с субботы 27 апреля'),
(47,'2024-04-30',7,'Перенос с субботы 2 ноября'),
(49,'2024-12-28',2,'Перенос с понедельника 30 декабря'),
(51,'2024-12-30',7,'Перенос с субботы 28 декабря');
